In [1]:
import pandas as pd

In [2]:
df=pd.read_excel(r"Downloads\insurence_file.xlsx",sheet_name="Sheet2")

In [3]:
df

      NAME LOCATION  ACCOUNT_NUMBER  AGE
0     RAVI   GUDURU           12345   25
1   RAJESH      MTM           78934   26
2   RAHEEM      BZA           34567   30
3    SANDY    VUYUR           98765   19
4   AKHEEL    PAMAR           11234   34
5     PREM   PEDANA           44556   42
6  MALATHI      MTM           88776   19
7  LAKSHMI   GUDURU           55432   27
8   TULASI      BZA           67895   32
9   HEMNTH   PEDANA           14567   28

In [ ]:
##################  basic check in dataframe #####################

In [4]:
df.head()

     NAME LOCATION  ACCOUNT_NUMBER  AGE
0    RAVI   GUDURU           12345   25
1  RAJESH      MTM           78934   26
2  RAHEEM      BZA           34567   30
3   SANDY    VUYUR           98765   19
4  AKHEEL    PAMAR           11234   34

In [5]:
df.tail()

      NAME LOCATION  ACCOUNT_NUMBER  AGE
5     PREM   PEDANA           44556   42
6  MALATHI      MTM           88776   19
7  LAKSHMI   GUDURU           55432   27
8   TULASI      BZA           67895   32
9   HEMNTH   PEDANA           14567   28

In [6]:
df.shape

(10, 4)

In [7]:
df.dtypes

NAME              object
LOCATION          object
ACCOUNT_NUMBER     int64
AGE                int64
dtype: object

In [8]:
df.info

<bound method DataFrame.info of       NAME LOCATION  ACCOUNT_NUMBER  AGE
0     RAVI   GUDURU           12345   25
1   RAJESH      MTM           78934   26
2   RAHEEM      BZA           34567   30
3    SANDY    VUYUR           98765   19
4   AKHEEL    PAMAR           11234   34
5     PREM   PEDANA           44556   42
6  MALATHI      MTM           88776   19
7  LAKSHMI   GUDURU           55432   27
8   TULASI      BZA           67895   32
9   HEMNTH   PEDANA           14567   28>

In [9]:
df.columns

Index(['NAME', 'LOCATION', 'ACCOUNT_NUMBER', 'AGE'], dtype='object')

In [ ]:
###############   filters #########################

In [ ]:
######################################## columns filter ######################################

In [20]:
df["NAME"]

0       RAVI
1     RAJESH
2     RAHEEM
3      SANDY
4     AKHEEL
5       PREM
6    MALATHI
7    LAKSHMI
8     TULASI
9     HEMNTH
Name: NAME, dtype: object

In [19]:
df["NAME"],df["LOCATION"],df["ACCOUNT_NUMBER"],df["AGE"]

(0       RAVI
 1     RAJESH
 2     RAHEEM
 3      SANDY
 4     AKHEEL
 5       PREM
 6    MALATHI
 7    LAKSHMI
 8     TULASI
 9     HEMNTH
 Name: NAME, dtype: object,
 0    GUDURU
 1       MTM
 2       BZA
 3     VUYUR
 4     PAMAR
 5    PEDANA
 6       MTM
 7    GUDURU
 8       BZA
 9    PEDANA
 Name: LOCATION, dtype: object,
 0    12345
 1    78934
 2    34567
 3    98765
 4    11234
 5    44556
 6    88776
 7    55432
 8    67895
 9    14567
 Name: ACCOUNT_NUMBER, dtype: int64,
 0    25
 1    26
 2    30
 3    19
 4    34
 5    42
 6    19
 7    27
 8    32
 9    28
 Name: AGE, dtype: int64)

In [10]:
df.NAME

0       RAVI
1     RAJESH
2     RAHEEM
3      SANDY
4     AKHEEL
5       PREM
6    MALATHI
7    LAKSHMI
8     TULASI
9     HEMNTH
Name: NAME, dtype: object

In [17]:
df.NAME,df.LOCATION,df.ACCOUNT_NUMBER,df.AGE

(0       RAVI
 1     RAJESH
 2     RAHEEM
 3      SANDY
 4     AKHEEL
 5       PREM
 6    MALATHI
 7    LAKSHMI
 8     TULASI
 9     HEMNTH
 Name: NAME, dtype: object,
 0    GUDURU
 1       MTM
 2       BZA
 3     VUYUR
 4     PAMAR
 5    PEDANA
 6       MTM
 7    GUDURU
 8       BZA
 9    PEDANA
 Name: LOCATION, dtype: object,
 0    12345
 1    78934
 2    34567
 3    98765
 4    11234
 5    44556
 6    88776
 7    55432
 8    67895
 9    14567
 Name: ACCOUNT_NUMBER, dtype: int64,
 0    25
 1    26
 2    30
 3    19
 4    34
 5    42
 6    19
 7    27
 8    32
 9    28
 Name: AGE, dtype: int64)

In [21]:
df[['NAME', 'LOCATION', 'ACCOUNT_NUMBER', 'AGE']]

      NAME LOCATION  ACCOUNT_NUMBER  AGE
0     RAVI   GUDURU           12345   25
1   RAJESH      MTM           78934   26
2   RAHEEM      BZA           34567   30
3    SANDY    VUYUR           98765   19
4   AKHEEL    PAMAR           11234   34
5     PREM   PEDANA           44556   42
6  MALATHI      MTM           88776   19
7  LAKSHMI   GUDURU           55432   27
8   TULASI      BZA           67895   32
9   HEMNTH   PEDANA           14567   28

In [36]:
df.filter(["NAME"])

      NAME
0     RAVI
1   RAJESH
2   RAHEEM
3    SANDY
4   AKHEEL
5     PREM
6  MALATHI
7  LAKSHMI
8   TULASI
9   HEMNTH

In [37]:
df.filter(['NAME', 'LOCATION', 'ACCOUNT_NUMBER', 'AGE'])

      NAME LOCATION  ACCOUNT_NUMBER  AGE
0     RAVI   GUDURU           12345   25
1   RAJESH      MTM           78934   26
2   RAHEEM      BZA           34567   30
3    SANDY    VUYUR           98765   19
4   AKHEEL    PAMAR           11234   34
5     PREM   PEDANA           44556   42
6  MALATHI      MTM           88776   19
7  LAKSHMI   GUDURU           55432   27
8   TULASI      BZA           67895   32
9   HEMNTH   PEDANA           14567   28

In [ ]:
########################### column with value filter #########################

In [39]:
df[df["NAME"]=="SANDY"]

    NAME LOCATION  ACCOUNT_NUMBER  AGE
3  SANDY    VUYUR           98765   19

In [40]:
df[df["NAME"]=="SANDY"],df[df["NAME"]=="HEMNTH"],df[df["NAME"]=="PREM"]

(    NAME LOCATION  ACCOUNT_NUMBER  AGE
 3  SANDY    VUYUR           98765   19,
      NAME LOCATION  ACCOUNT_NUMBER  AGE
 9  HEMNTH   PEDANA           14567   28,
    NAME LOCATION  ACCOUNT_NUMBER  AGE
 5  PREM   PEDANA           44556   42)

In [41]:
df.loc[df["NAME"]=="SANDY"]

    NAME LOCATION  ACCOUNT_NUMBER  AGE
3  SANDY    VUYUR           98765   19

In [45]:
df.query("NAME =='PREM'")

   NAME LOCATION  ACCOUNT_NUMBER  AGE
5  PREM   PEDANA           44556   42